using System;
using System.Collections.Generic;
using System.Text;

namespace Day_07
{
    [Flags]
    enum PersonStyle
    {
        tall = 1,                   //0000000001
        rich = 2,                   //0000000010
        handsome = 4,               //0000000100
        whlie = 8,                  //0000001000
        beauty = 16                 //0000010000
    }
    /*
     * 选择多个枚举值
     * 运算符 | (按位或)：两个对应的二进制位中有一个为1，结果为1
     * tall | rich  ==> 0000000001 | 0000000010 ==> 0000000011
     * 
     * 条件：
     * 1.任意多个枚举值做 | 按位或 运算的结果不能与其他枚举值相同（值以2的N次方递增） （*）
     * 2.定义枚举时，使用[Flags]特性修饰，（标记可多选）
     * 
     * 判断标志枚举是否包含指定枚举值
     * 运算符 & (按位与)：两个对应的二进制位中有两个都为1，结果为1
     * 0000000011 @ 0000000010 ==> 0000000010
     */
}
